Ran Plan for 3 projects:

1. project: `sandbox` dir: `terraform` workspace: `default`
1. project: `staging` dir: `terraform` workspace: `default`
1. project: `prod` dir: `terraform` workspace: `default`

### 1. project: `sandbox` dir: `terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
ENVIRONMENT = sandbox

TERRAFORM VERSION: 1.0.8


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # azurerm_public_ip.public_ip will be created
+ resource "azurerm_public_ip" "public_ip" {
      + allocation_method       = "Dynamic"
      + availability_zone       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus2"
      + name                    = "bhs-pip-test-us-sandbox"
      + resource_group_name     = "bhs-rg-us-sandbox"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + zones                   = (known after apply)
    }

  # azurerm_resource_group.resource_group will be created
+ resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "bhs-rg-us-sandbox"
      + tags     = {
          + "creator" = "terraform"
          + "env"     = "sandbox"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

##### Infracost estimate #####

Monthly cost will increase by $2.92

Previous monthly cost: $0.00
New monthly cost: $2.92

Infracost output:

    Project: fernandomatsuo-moduscreate/p1-atlantis/terraform/sandbox-default.tfplan
    
    + azurerm_public_ip.public_ip
      +$2.92
    
        + IP address (dynamic)
          +$2.92
    
    Monthly cost change for fernandomatsuo-moduscreate/p1-atlantis/terraform/sandbox-default.tfplan
    Amount:  +$2.92 ($0.00 -> $2.92)
    
    ----------------------------------
    Key: ~ changed, + added, - removed

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p sandbox`
* :put_litter_in_its_place: To **delete** this plan click [here](https://p1-atlantis-instance.familiamatsuo.com/lock?id=fernandomatsuo-moduscreate%252Fp1-atlantis%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p sandbox`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. project: `staging` dir: `terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
ENVIRONMENT = staging

TERRAFORM VERSION: 1.0.8


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # azurerm_public_ip.public_ip will be created
+ resource "azurerm_public_ip" "public_ip" {
      + allocation_method       = "Dynamic"
      + availability_zone       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus2"
      + name                    = "bhs-pip-test-us-sandbox"
      + resource_group_name     = "bhs-rg-us-sandbox"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + zones                   = (known after apply)
    }

  # azurerm_resource_group.resource_group will be created
+ resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "bhs-rg-us-sandbox"
      + tags     = {
          + "creator" = "terraform"
          + "env"     = "sandbox"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

##### Infracost estimate #####

Monthly cost will increase by $2.92

Previous monthly cost: $0.00
New monthly cost: $2.92

Infracost output:

    Project: fernandomatsuo-moduscreate/p1-atlantis/terraform/staging-default.tfplan
    
    + azurerm_public_ip.public_ip
      +$2.92
    
        + IP address (dynamic)
          +$2.92
    
    Monthly cost change for fernandomatsuo-moduscreate/p1-atlantis/terraform/staging-default.tfplan
    Amount:  +$2.92 ($0.00 -> $2.92)
    
    ----------------------------------
    Key: ~ changed, + added, - removed

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p staging`
* :put_litter_in_its_place: To **delete** this plan click [here](https://p1-atlantis-instance.familiamatsuo.com/lock?id=fernandomatsuo-moduscreate%252Fp1-atlantis%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p staging`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 3. project: `prod` dir: `terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
ENVIRONMENT = prod

TERRAFORM VERSION: 1.0.8


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # azurerm_public_ip.public_ip will be created
+ resource "azurerm_public_ip" "public_ip" {
      + allocation_method       = "Dynamic"
      + availability_zone       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus2"
      + name                    = "bhs-pip-test-us-sandbox"
      + resource_group_name     = "bhs-rg-us-sandbox"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + zones                   = (known after apply)
    }

  # azurerm_resource_group.resource_group will be created
+ resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "bhs-rg-us-sandbox"
      + tags     = {
          + "creator" = "terraform"
          + "env"     = "sandbox"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

##### Infracost estimate #####

Monthly cost will increase by $2.92

Previous monthly cost: $0.00
New monthly cost: $2.92

Infracost output:

    Project: fernandomatsuo-moduscreate/p1-atlantis/terraform/prod-default.tfplan
    
    + azurerm_public_ip.public_ip
      +$2.92
    
        + IP address (dynamic)
          +$2.92
    
    Monthly cost change for fernandomatsuo-moduscreate/p1-atlantis/terraform/prod-default.tfplan
    Amount:  +$2.92 ($0.00 -> $2.92)
    
    ----------------------------------
    Key: ~ changed, + added, - removed

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p prod`
* :put_litter_in_its_place: To **delete** this plan click [here](https://p1-atlantis-instance.familiamatsuo.com/lock?id=fernandomatsuo-moduscreate%252Fp1-atlantis%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p prod`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
